In [39]:
import pandas as pd
data = [['Dan', 30, 40000], ['John', 40, 50000],
       ['Helen', 35, 60000], ['Marry', 29, 58000]]
#print(dir(pd.DataFrame))
df = pd.DataFrame(data = data, columns = ["Name","Age","Salary"])

In [2]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [3]:
df["Salary"] > 50000

0    False
1    False
2     True
3     True
Name: Salary, dtype: bool

In [4]:
df[df["Salary"] > 50000]

    Name  Age  Salary
2  Helen   35   60000
3  Marry   29   58000

In [8]:
df[df.loc[:,"Salary"]< 50000]

  Name  Age  Salary
0  Dan   30   40000

In [9]:
df[df.loc[:,"Salary"]< 50000]["Name"]

0    Dan
Name: Name, dtype: object

In [11]:
df[df.loc[:,"Salary"] < 50000][["Name","Age"]]

  Name  Age
0  Dan   30

In [12]:
df[df.loc[:,"Age"] == 30]

  Name  Age  Salary
0  Dan   30   40000

In [13]:
df[~(df.loc[:,"Salary"] < 50000)]

    Name  Age  Salary
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [17]:
df["Age"]== 40

0    False
1     True
2    False
3    False
Name: Age, dtype: bool

In [18]:
df["Age"].max()

40

In [19]:
df.Age.max()

40

In [23]:
i = df["Salary"].idxmax()

In [24]:
i

2

In [25]:
df.iloc[i]

Name      Helen
Age          35
Salary    60000
Name: 2, dtype: object

In [26]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [34]:
df.set_index("Salary",inplace=True)

In [35]:
df

         Name  Age
Salary
40000     Dan   30
50000    John   40
60000   Helen   35
58000   Marry   29

In [36]:
df

         Name  Age
Salary
40000     Dan   30
50000    John   40
60000   Helen   35
58000   Marry   29

In [37]:
df.loc[50000]

Name    John
Age       40
Name: 50000, dtype: object

In [38]:
df.iloc[1]

Name    John
Age       40
Name: 50000, dtype: object

In [40]:
df

    Name  Age  Salary
0    Dan   30   40000
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000

In [46]:
df[(df["Salary"] > 50000)|(df["Age"] <30)]

    Name  Age  Salary
2  Helen   35   60000
3  Marry   29   58000

In [49]:
df[df["Salary"].between(50000,60000)]

    Name  Age  Salary
1   John   40   50000
2  Helen   35   60000
3  Marry   29   58000